Revit 2026 API

# ExportPDFSettingsIsValidName Method

---

Returns result that the proposed name is valid and not exist in the specified document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidName(
	Document document,
	string name
)
```
```vb
Public Shared Function IsValidName (
	document As Document,
	name As String
) As Boolean
```
```cpp
public:
static bool IsValidName(
	Document^ document,
	String^ name
)
```
```fsharp
static member IsValidName :
        document : Document *
        name : string -> bool
```

#### Parameters

document Document
     Document to check
name String
     Name to check.

#### Return Value

Boolean Whether or not the name is valid.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Name can't contains following characters, such as { } [ ] | ; < > ? ` ~ \ : \r \n \f \t \v. Name can't be blank. If true, the name is valid and not exist in specified document. If false, the name is not a valid name which means it does not exist in specified document.

#### Reference

ExportPDFSettings Class

Autodesk.Revit.DB Namespace